### olympics.csv

* Drop all of the countries which don’t have gold medals, and save the cleaned one back into a new .csv file

In [2]:
import pandas as pd

In [20]:
data = pd.read_csv("olympics.csv",header=1)

In [21]:
new_names =  {'Unnamed: 0': 'Country',
              '? Summer': 'Summer Olympics',
              '01 !': 'Gold',
              '02 !': 'Silver',
              '03 !': 'Bronze',
              '? Winter': 'Winter Olympics',
              '01 !.1': 'Gold.1',
              '02 !.1': 'Silver.1',
              '03 !.1': 'Bronze.1',
              '? Games': '# Games',
              '01 !.2': 'Gold.2',
              '02 !.2': 'Silver.2',
              '03 !.2': 'Bronze.2'}

In [22]:
data.rename(columns=new_names,inplace=True)

In [23]:
data = data[data['Country']!='Totals']

In [24]:
data.drop(['Gold.2','Silver.2','Bronze.2'],axis=1,inplace=True)

In [25]:
data.head()

,Country,Summer Olympics,Gold,Silver,Bronze,Total,Winter Olympics,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Combined total
0,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,2
1,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,15
2,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,70
3,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,12
4,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,12

In [26]:
# data.to_csv(r"C:\Users\pavan\Desktop\cleaned.csv")

In [27]:
data[[x for x in data.columns if 'gold' in x.lower()]].head()

   Gold  Gold.1
0     0       0
1     5       0
2    18       0
3     1       0
4     3       0

In [28]:
data['Total_Gold_Medals'] = data['Gold']+data['Gold.1']

#### Drop all of the countries which don’t have gold medals, and save the cleaned one back into a new .csv file.

In [29]:
# data[data['Total_Gold_Medals']>0].to_csv("AtleastOne_Gold_Medal.csv",index=False)

#### Output the top five gold medal countries.

In [40]:
print("\n".join(data.sort_values(['Total_Gold_Medals'],ascending=False).head(5)['Country'].values))

United States (USA) [P] [Q] [R] [Z]
Soviet Union (URS) [URS]
Germany (GER) [GER] [Z]
Great Britain (GBR) [GBR] [Z]
Italy (ITA) [M] [S]

#### Output the countries that have all three kinds of medals for both summer and winter games

In [54]:
allMedals_countries = data[(data['Gold']>0) & (data['Silver']>0) & (data['Bronze']>0) & (data['Gold.1']>0) & (data['Silver.1']>0) & (data['Bronze.1']>0)]
print("\n".join(list(allMedals_countries['Country'])))

Australia (AUS) [AUS] [Z]
Austria (AUT)
Belarus (BLR)
Belgium (BEL)
Bulgaria (BUL) [H]
Canada (CAN)
China (CHN) [CHN]
Croatia (CRO)
Czech Republic (CZE) [CZE]
Czechoslovakia (TCH) [TCH]
Estonia (EST)
Finland (FIN)
France (FRA) [O] [P] [Z]
Germany (GER) [GER] [Z]
United Team of Germany (EUA) [EUA]
East Germany (GDR) [GDR]
West Germany (FRG) [FRG]
Great Britain (GBR) [GBR] [Z]
Italy (ITA) [M] [S]
Japan (JPN)
Kazakhstan (KAZ)
South Korea (KOR)
Netherlands (NED) [Z]
Norway (NOR) [Q]
Poland (POL)
Russia (RUS) [RUS]
Soviet Union (URS) [URS]
Unified Team (EUN) [EUN]
Slovakia (SVK) [SVK]
Slovenia (SLO)
Sweden (SWE) [Z]
Switzerland (SUI)
Ukraine (UKR)
United States (USA) [P] [Q] [R] [Z]

## BL-Flicker-Images-Book.csv file

In [3]:
data = pd.read_csv("BL-Flickr-Images-Book.csv")

In [57]:
data.head()

,Identifier,Edition Statement,Place of Publication,Date of Publication,Publisher,Title,Author,Contributors,Corporate Author,Corporate Contributors,Former owner,Engraver,Issuance type,Flickr URL,Shelfmarks
0,206,NaN,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,"FORBES, Walter.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12641.b.30.
1,216,NaN,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12626.cc.2.
2,218,NaN,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12625.dd.1.
3,472,NaN,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.","Appleyard, Ernest Silvanus.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 10369.bbb.15.
4,480,"A new edition, revised, etc.",London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.","BROOME, John Henry.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 9007.d.28.

In [27]:
def grab_title(x):
    x = x.replace("[","").replace(']','')
    x = x.split(".")[0]
    return x.strip()

* Grab Title

In [28]:
data['Title'] =data['Title'].apply(lambda x:grab_title(x))

* Author & Contributor Fields Cleaning:

In [166]:
def get_author(x):
    if isinstance(x,str):
        if "|" in x:
            return x.split("|")[0]
        elif "," in x:
            first_name = x.split(",")[0]
            second_name = x.split(",")[1].strip()
            if "(" in second_name and ")" in second_name:
                second_name = re.findall(r"\((\w*)\)",second_name)
            else:
                try:
                    second_name = re.split("\W",second_name)
                except:
                    secon_name = ""
            if isinstance(second_name,list):
                second_name = " ".join(second_name)
            return first_name +" "+ second_name
#             return (first_name,second_name)
        return x.split("  ")[0].replace("afterwards","")
    return x

In [167]:
data['Author'] = data['Author'].apply(lambda x:get_author(x))
data['Contributors'] = data['Contributors'].apply(lambda x:get_author(x))

In [168]:
data.to_csv("Assignment.csv")